Tutorial2/Unbaffled/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  
  {
    name    injection1;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (0.88 0.1 1.43) (0.98 0.11 1.47);//box (-0.02 -0.13 -0.02) (0.02 -0.12 0.02);
    }
  } 

);

// ************************************************************************* //
